{
  "intents": [
    {
      "tag": "information of 302",
      "patterns": [
        "What do you mean by the 302 act in law?",
        "What is section 302 related to?",
        "Explain the section 302?",
        "Which person is liable to 302?",
        "Information about 302",
        "What is 302?",
        "Pakistan Penal Code Section 302",
        "PPC 302 Pakistan",
        "Section 302 PPC",
        "Pakistan Penal Code Section 302 full text",
        "Full text of PPC 302",
        "PPC 302 legal provisions",
        "Section 302 PPC Pakistan jurisdiction",
        "PPC 302 case law Pakistan",
        "Historical background of PPC Section 302",
        "Evolution of Section 302 in Pakistan Penal Code",
        "Legal Commentary of 302",
        "Legal commentary on PPC Section 302",
        "Interpretation of Section 302 PPC",
        "Expert opinions on PPC 302",
        "Landmark cases under PPC Section 302",
        "Precedents for Section 302 in Pakistan",
        "Notable judgments related to PPC 302",
        "Comparison of murder laws in PPC and other jurisdictions",
        "PPC Section 302",
        "Recent changes to PPC Section 302",
        "News on PPC 302 amendments",
        "Official Government Sources of Section 302",
        "Pakistan government website PPC Section 302",
        "Official PPC Section 302 information",
        "Text of Section 302 PPC",
        "Full legal text murder law PPC",
        "Complete wording of PPC Section 302",
        "Interpretation of PPC Section 302",
        "Meaning of terms in Section 302 PPC",
        "How is Section 302 defined in PPC",
        "PPC 302 case law precedents",
        "Landmark cases under Section 302 PPC",
        "Judicial decisions on PPC 302",
        "Legislative history of PPC Section 302",
        "Amendments to Section 302 over time",
        "Changes in PPC murder laws",
        "Comparative analysis of murder laws internationally",
        "How does Pakistan's Section 302 compare globally",
        "International standards for murder legislation",
        "Enforcement of PPC Section 302",
        "Prosecution under Section 302 PPC",
        "Law enforcement procedures for murder cases in Pakistan",
        "PPC Section 302 discussion forum",
        "Legal community opinions on PPC 302",
        "Lawyer insights on Section 302 PPC",
        "Academic articles on PPC Section 302",
        "Research papers on murder laws in Pakistan",
        "Scholarly analysis of PPC 302",
        "Public policy impact of PPC Section 302",
        "Societal implications of murder laws in Pakistan",
        "Policy discussions on PPC 302",
        "Government publications on Section 302 PPC",
        "Reports on murder statistics under PPC",
        "Official documents related to PPC 302",
        "Give me murder laws",
        "What does Section 302 PPC say?",
        "Can you explain PPC Section 302?",
        "What are the punishments under Section 302?",
        "Details about murder laws in Pakistan",
        "Can you please provide me the detail of section 302",
        "Can you provide me the detail of section 302"
      ],
      "responses": [
        "Punishment of qatl-i-amd: \nWhoever commits qatl-e-amd shall, subject to the provisions of this Chapter be:\n(a) punished with death as qisas;\n(b) punished with death or imprisonment for life as ta'zir having regard to the facts and circumstances of the case, if the proof in either of the forms specified in Section 304 is not available; or\n(c) punished with imprisonment of either description for a term which may extend to twenty-five years, where according to the injunctions of Islam the punishment of qisas is not applicable.\nProvided that nothing in this clause shall apply to the offence of qatl-i-amd if committed in the name or on the pretext of honour and the same shall fall within the ambit of (a) and (b), as the case may be.",
        "Section 302 of the Pakistan Penal Code deals with the punishment for qatl-i-amd (intentional murder). The punishment can be death as qisas, death or life imprisonment as ta'zir depending on the circumstances of the case, or imprisonment up to 25 years if qisas is not applicable.",
        "Under Section 302 of the Pakistan Penal Code, intentional murder (qatl-i-amd) can result in death as qisas, death or life imprisonment as ta'zir, or up to 25 years imprisonment if qisas is not applicable. Honor killings fall under the more severe punishments of death or life imprisonment.",
        "The Pakistan Penal Code Section 302 outlines the punishments for intentional murder (qatl-i-amd). The penalties include death as qisas, death or life imprisonment as ta'zir, or up to 25 years imprisonment if qisas does not apply, particularly noting that honor-related killings are severely punished.",
        "According to Section 302 of the PPC, qatl-i-amd (intentional murder) is punishable by death as qisas, death or life imprisonment as ta'zir, or up to 25 years imprisonment where qisas is not applicable. This ensures that honor-related killings are treated with utmost severity.",
        "In the context of the Pakistan Penal Code, Section 302 prescribes that those found guilty of intentional murder (qatl-i-amd) can face the death penalty as qisas, life imprisonment or death as ta'zir, and imprisonment up to 25 years if qisas isn't applicable, with a strict stance against honor killings.",
        "Section 302 PPC provides a framework for penalizing intentional murder (qatl-i-amd) with death as qisas, death or life imprisonment as ta'zir, or up to 25 years in prison if qisas is not applicable. Notably, it includes stringent measures for honor-related offenses.",
        "The legal provisions under Section 302 of the PPC for qatl-i-amd (intentional murder) include death as qisas, death or life imprisonment as ta'zir based on case specifics, or a maximum of 25 years imprisonment when qisas is not applicable, emphasizing the serious handling of honor-related murders."
      ]
    },
    {
      "tag": "information of 299",
      "patterns": [
        "What do you mean by the 299 act in law?",
        "What is section 299 related to?",
        "Explain the section 299?",
        "Which person is liable to 299?",
        "Information about 299",
        "What is 299?",
        "Pakistan Penal Code Section 299",
        "PPC 299 Pakistan",
        "Section 299 PPC",
        "Pakistan Penal Code Section 299 full text",
        "Full text of PPC 299",
        "PPC 299 legal provisions",
        "Section 299 PPC Pakistan jurisdiction",
        "PPC 299 case law Pakistan",
        "Historical background of PPC Section 299",
        "Evolution of Section 299 in Pakistan Penal Code",
        "Legal Commentary of 299",
        "Legal commentary on PPC Section 299",
        "Interpretation of Section 299 PPC",
        "Expert opinions on PPC 299",
        "Give me the detail of 299",
        "What does PPC 299 cover?",
        "Explain the legal terms in Section 299",
        "Break down Section 299 of PPC",
        "What are the key points of Section 299?",
        "What does Section 299 of the Pakistan Penal Code state?",
        "How is Section 299 applied?",
        "Examples of cases under Section 299",
        "What is the significance of Section 299 in Pakistani law?",
        "Can you please provide me the detail of section 299",
        "Can you provide me the detail of section 299"
      ],
      "responses": [
        "Definitions: \n In this Chapter, unless there is anything repugnant in the subject or context:\n(a) 'adult' means a person who has attained the age of eighteen years; \n (b) 'arsh' means the compensation specified in this Chapter to be paid to the victim or his heirs under this Chapter;\n(c) 'authorised medical officer' means a medical officer or a Medical board, howsoever designated, authorised by the Provincial Government; \n(d) 'daman' means the compensation determined by the Court to be paid by the offender to the victim for causing hurt not liable to arsh;,\n(e) 'diyat' means the compensation specified in Section 323 payable to the heirs of the victim;\n(f) 'Government' means the Provincial Government; \n(g) 'ikrah-e-tam' means putting any person, his spouse or any of his blood relations within the prohibited degree of marriage in fear of instant death or instant, permanent impairing of any organ of the body or instant fear of being subjected to sodomy or ziha-bil-jabr; \n(h) 'ikrah-e-naqis' means any form of duress which does not amount to ikrah-i-tam; \n(i) 'minor' means a person who is not an adult;\n112[(ii) 'offence committed in the name or on the pretext of honour' means an offence committed in the name or on the pretext of karo kari, siyah kari or similar other customs or practices;] 112 \n(j) 'qatl' means causing death of a person; \n(k) 'qisas' means punishment by causing similar hurt at the same part of the body of the convict as he has caused to the victim or by causing his death if he has committed qatl-iamd in exercise Of the right of the victim or a Wali; \n(l) 'tazir' means punishment other than qisas, diyat, arsh, or daman; and \n(m) 'wali' means a person entitled to claim qisas.",
        "Section 299 of the Pakistan Penal Code defines key terms related to offenses such as 'qatl' (murder), 'qisas' (retaliatory punishment), 'diyat' (compensation for murder), and 'arsh' (compensation for injury). This section lays the foundation for understanding how various crimes are classified and the corresponding punishments.",
        "Under Section 299 of the Pakistan Penal Code, several important legal definitions are provided: 'qatl' refers to the act of causing death, 'qisas' is the punishment involving an equivalent harm or death, 'diyat' is the monetary compensation for the heirs of the victim, and 'arsh' is compensation for bodily harm.",
        "Section 299 of the PPC includes definitions such as 'adult' for individuals 18 years and older, 'minor' for those under 18, 'ikrah-e-tam' for extreme duress, and 'ikrah-e-naqis' for lesser duress. It also outlines terms like 'qatl' for murder and 'qisas' for retaliatory justice.",
        "The Pakistan Penal Code Section 299 serves as a foundational legal reference for understanding the definitions and applications of various punishments, such as 'qisas' and 'diyat,' in the context of serious crimes like murder ('qatl') and bodily harm. It also clarifies the roles of medical officers and the definitions of adulthood and minority.",
        "Section 299 outlines various legal definitions critical to the Pakistani legal system, including 'arsh' (compensation for injury), 'diyat' (compensation for murder), and 'qisas' (retaliatory justice). It helps establish the framework for how justice is administered in cases of serious crimes.",
        "The legal terms defined in Section 299 of the PPC include 'qisas' for retaliatory punishment, 'diyat' for compensation payable to the victim's heirs, and 'arsh' for compensation for injury. These terms are essential for understanding the legal proceedings and punishments for offenses such as murder and bodily harm.",
        "Section 299 of the Pakistan Penal Code is fundamental in providing definitions such as 'adult' and 'minor,' specifying compensation types like 'arsh' and 'diyat,' and clarifying punishments like 'qisas.' These definitions are crucial for legal interpretation and application in cases involving serious offenses."
      ]
    },
    {
      "tag": "information of 300",
      "patterns": [
        "What do you mean by the 300 act in law?",
        "What is section 300 related to?",
        "Explain the section 300?",
        "Which person is liable to 300?",
        "Information about 300",
        "What is 300?",
        "Pakistan Penal Code Section 300",
        "PPC 300 Pakistan",
        "Section 300 PPC",
        "Pakistan Penal Code Section 300 full text",
        "Full text of PPC 300",
        "PPC 300 legal provisions",
        "Section 300 PPC Pakistan jurisdiction",
        "PPC 300 case law Pakistan",
        "Historical background of PPC Section 300",
        "Evolution of Section 300 in Pakistan Penal Code",
        "Legal Commentary of 300",
        "Legal commentary on PPC Section 300",
        "Interpretation of Section 300 PPC",
        "Expert opinions on PPC 300",
        "Give me the detail of 300",
        "What does Section 300 PPC define?",
        "Can you explain PPC Section 300?",
        "What are the key points of Section 300?",
        "How is Section 300 defined in PPC?",
        "Details about Section 300 of PPC",
        "PPC 300 legal definitions",
        "How does Section 300 of PPC apply?",
        "Legal interpretation of Section 300",
        "Explain the legal terms in Section 300",
        "What constitutes qatl-e-amd under Section 300?",
        "Describe qatl-e-amd as per Section 300 PPC",
        "Can you please provide me the detail of section 300",
        "Can you provide me the detail of section 300"
      ],
      "responses": [
        "Qatl-e-Amd: \nWhoever, with the intention of causing death or with the intention of causing bodily injury to a person, by doing an act which in the ordinary course of nature is likely to cause death, or with the knowledge that his act is so imminently dangerous that it must in all probability cause death, causes the death of such person, is said to commit qatl-e-amd.",
        "According to Section 300 of the Pakistan Penal Code, qatl-e-amd is defined as causing death with the intention to cause death or cause bodily injury that is likely to result in death, or knowing that the act is imminently dangerous and likely to cause death.",
        "Section 300 of the PPC defines qatl-e-amd as causing the death of a person with the intention of causing death, causing bodily injury likely to result in death, or performing an act so dangerous that it is likely to cause death.",
        "Under Section 300 of the Pakistan Penal Code, qatl-e-amd involves causing death with intent or knowledge that the act is likely to cause death. This includes intending to cause death, intending to cause injury likely to cause death, or knowing the act is imminently dangerous.",
        "The Pakistan Penal Code Section 300 describes qatl-e-amd as an act done with the intention of causing death, or with the intention of causing bodily injury likely to cause death, or knowing that the act is so dangerous it will probably cause death.",
        "Section 300 PPC explains qatl-e-amd as intentionally causing death, causing bodily harm that in the ordinary course of nature would likely cause death, or knowing the act is imminently dangerous and likely to cause death.",
        "In the context of the PPC, Section 300 describes qatl-e-amd as causing death with the intent to kill or cause serious injury likely to result in death, or knowing that one's actions are so dangerous that they are likely to cause death.",
        "Qatl-e-amd, as defined in Section 300 of the PPC, occurs when someone causes another person's death with the intention to kill, with the intention to cause injury likely to cause death, or with knowledge that their actions are imminently dangerous and likely to cause death."
      ]
    },
    {
      "tag": "information of 301",
      "patterns": [
        "What do you mean by the 301 act in law?",
        "What is section 301 related to?",
        "Explain the section 301?",
        "Which person is liable to 301?",
        "Information about 301",
        "What is 301?",
        "Pakistan Penal Code Section 301",
        "PPC 301 Pakistan",
        "Section 301 PPC",
        "Pakistan Penal Code Section 301 full text",
        "Full text of PPC 301",
        "PPC 301 legal provisions",
        "Section 301 PPC Pakistan jurisdiction",
        "PPC 301 case law Pakistan",
        "Historical background of PPC Section 301",
        "Evolution of Section 301 in Pakistan Penal Code",
        "Legal Commentary of 301",
        "Legal commentary on PPC Section 301",
        "Interpretation of Section 301 PPC",
        "Expert opinions on PPC 301",
        "Give me the detail of 301",
        "What does Section 301 PPC define?",
        "Can you explain PPC Section 301?",
        "What are the key points of Section 301?",
        "How is Section 301 defined in PPC?",
        "Details about Section 301 of PPC",
        "PPC 301 legal definitions",
        "How does Section 301 of PPC apply?",
        "Legal interpretation of Section 301",
        "Explain the legal terms in Section 301",
        "What constitutes an offense under Section 301?",
        "Describe the provisions of Section 301 PPC",
        "Can you please provide me the detail of section 302",
        "Can you provide me the detail of section 302"
      ],
      "responses": [
        "Causing death of person other than the person whose death was intended: \nWhere a person, by doing anything which he intends or knows to be likely to cause death, causes death of any person whose death he neither intends nor knows himself to be likely to cause, such an act committed by the offender shall be liable for qatl-i-amd.",
        "Section 301 of the Pakistan Penal Code addresses situations where a person causes the death of someone other than the intended victim. If a person, knowing their actions are likely to cause death, accidentally causes the death of another, it is considered qatl-i-amd.",
        "According to Section 301 of the PPC, if a person performs an act intending to cause death or knowing it is likely to cause death, and someone other than the intended victim dies, it is treated as qatl-i-amd.",
        "Under Section 301 of the Pakistan Penal Code, causing the death of a person other than the intended victim, when the act was known or intended to be likely to cause death, is considered qatl-i-amd and the offender is held liable.",
        "The Pakistan Penal Code Section 301 states that if a person, by doing something they intend or know to be likely to cause death, causes the death of another person whom they neither intended nor knew was likely to be killed, it is still treated as qatl-i-amd.",
        "Section 301 PPC defines situations where a person, by performing an act intended or known to be likely to cause death, accidentally causes the death of someone else. Such cases are treated as qatl-i-amd under the law.",
        "According to Section 301 PPC, causing the death of someone other than the intended target, when the act was known to likely cause death, makes the offender liable for qatl-i-amd.",
        "In the context of the PPC, Section 301 covers instances where a person knowingly or intentionally causes death, and the death of another unintended person occurs. This is considered qatl-i-amd and the perpetrator is held accountable."
      ]
    },
    {
      "tag": "information of 303",
      "patterns": [
        "What do you mean by the 303 act in law?",
        "What is section 303 related to?",
        "Explain the section 303?",
        "Which person is liable to 303?",
        "Information about 303",
        "What is 303?",
        "Pakistan Penal Code Section 303",
        "PPC 303 Pakistan",
        "Section 303 PPC",
        "Pakistan Penal Code Section 303 full text",
        "Full text of PPC 303",
        "PPC 303 legal provisions",
        "Section 303 PPC Pakistan jurisdiction",
        "PPC 303 case law Pakistan",
        "Historical background of PPC Section 303",
        "Evolution of Section 303 in Pakistan Penal Code",
        "Legal Commentary of 303",
        "Legal commentary on PPC Section 303",
        "Interpretation of Section 303 PPC",
        "Expert opinions on PPC 303",
        "Give me the detail of 303",
        "What does Section 303 PPC define?",
        "Can you explain PPC Section 303?",
        "What are the key points of Section 303?",
        "How is Section 303 defined in PPC?",
        "Details about Section 303 of PPC",
        "PPC 303 legal definitions",
        "How does Section 303 of PPC apply?",
        "Legal interpretation of Section 303",
        "Explain the legal terms in Section 303",
        "What constitutes an offense under Section 303?",
        "Describe the provisions of Section 303 PPC",
        "Can you please provide me the detail of section 303",
        "Can you provide me the detail of section 303"
      ],
      "responses": [
        "Qatl committed under ikrah-i-tam or ikrah-i-naqis: \nWhoever commits qatl:\n(a) under Ikrah-i-tam shall be punished with imprisonment for a term which may extend to twenty-five years but shall not be less than ten years and the person causing 'ikrah-i-tam' shall be punished for the kind of Qatl committed as a consequence of ikrah-i-tam; or\n(b) under 'ikrah-i-naqis' shall be punished for the kind of Qatl committed by him and the person causing 'ikrah-i-naqis, shall be punished with imprisonment for a term which may extend to ten years.",
        "Section 303 of the Pakistan Penal Code deals with qatl committed under duress (ikrah-i-tam or ikrah-i-naqis). If a person commits qatl under ikrah-i-tam, they may be imprisoned for a term of up to twenty-five years, while qatl committed under ikrah-i-naqis may result in imprisonment for up to ten years.",
        "According to Section 303 of the PPC, qatl committed under ikrah-i-tam or ikrah-i-naqis is punishable. If qatl is committed under ikrah-i-tam, the offender may face imprisonment for up to twenty-five years, and if under ikrah-i-naqis, imprisonment for up to ten years.",
        "Under Section 303 of the Pakistan Penal Code, qatl committed under duress (ikrah-i-tam or ikrah-i-naqis) is punishable. If qatl is committed under ikrah-i-tam, imprisonment for up to twenty-five years is prescribed, and if under ikrah-i-naqis, imprisonment for up to ten years.",
        "The Pakistan Penal Code Section 303 specifies punishment for qatl committed under duress (ikrah-i-tam or ikrah-i-naqis). If qatl is committed under ikrah-i-tam, imprisonment for up to twenty-five years but not less than ten years may be imposed.",
        "Section 303 PPC outlines penalties for qatl committed under duress, such as ikrah-i-tam or ikrah-i-naqis. The offender may face imprisonment for up to twenty-five years if qatl is committed under ikrah-i-tam or up to ten years under ikrah-i-naqis.",
        "In the context of the PPC, Section 303 addresses qatl committed under duress, specifying different punishments based on whether the qatl is committed under ikrah-i-tam or ikrah-i-naqis.",
        "Section 303 PPC deals with qatl committed under duress (ikrah-i-tam or ikrah-i-naqis), prescribing punishments of imprisonment based on the circumstances of the duress."
      ]
    },
    {
      "tag": "information of 304",
      "patterns": [
        "What do you mean by the 304 act in law?",
        "What is section 304 related to?",
        "Explain the section 304?",
        "Which person is liable to 304?",
        "Information about 304",
        "What is 304?",
        "Pakistan Penal Code Section 304",
        "PPC 304 Pakistan",
        "Section 304 PPC",
        "Pakistan Penal Code Section 304 full text",
        "Full text of PPC 304",
        "PPC 304 legal provisions",
        "Section 304 PPC Pakistan jurisdiction",
        "PPC 304 case law Pakistan",
        "Historical background of PPC Section 304",
        "Evolution of Section 304 in Pakistan Penal Code",
        "Legal Commentary of 304",
        "Legal commentary on PPC Section 304",
        "Interpretation of Section 304 PPC",
        "Expert opinions on PPC 304",
        "Give me the detail of 304",
        "What does Section 304 PPC define?",
        "Can you explain PPC Section 304?",
        "What are the key points of Section 304?",
        "How is Section 304 defined in PPC?",
        "Details about Section 304 of PPC",
        "PPC 304 legal definitions",
        "How does Section 304 of PPC apply?",
        "Legal interpretation of Section 304",
        "Explain the legal terms in Section 304",
        "What constitutes proof of qatl-i-amd under Section 304?",
        "Describe the provisions of Section 304 PPC",
        "Can you please provide me the detail of section 304",
        "Can you provide me the detail of section 304"
      ],
      "responses": [
        "Proof of qatl-i-amd liable to qisas, etc.: \n(1) Proof of qatl-i-amd shall be in any of the following forms, namely: -\n(a) the accused makes before a Court competent to try the offence a voluntary and true confession of the commission of the offence; or\n(b) by the evidence as provided in Article 17 of the Qanun-e-Shahadat, 1984 (P.O. No. 10 of 1984).\n(2) The provisions of sub-section (1) shall, mutatis, mutandis, apply to a hurt liable to qisas.",
        "Section 304 of the Pakistan Penal Code deals with the proof of qatl-i-amd liable to qisas (retribution). It outlines the acceptable forms of proof, including voluntary confessions by the accused or evidence as provided in Article 17 of the Qanun-e-Shahadat, 1984.",
        "According to Section 304 of the PPC, proof of qatl-i-amd liable to qisas may include voluntary confessions by the accused before a competent court or evidence as provided in Article 17 of the Qanun-e-Shahadat, 1984.",
        "Under Section 304 of the Pakistan Penal Code, proof of qatl-i-amd liable to qisas can be established through voluntary confessions by the accused or evidence as specified in Article 17 of the Qanun-e-Shahadat, 1984.",
        "The Pakistan Penal Code Section 304 specifies the acceptable forms of proof for qatl-i-amd liable to qisas, including voluntary confessions by the accused or specific evidentiary requirements outlined in Article 17 of the Qanun-e-Shahadat, 1984.",
        "Section 304 PPC outlines the criteria for proving qatl-i-amd liable to qisas, such as voluntary confessions by the accused or evidence as provided in Article 17 of the Qanun-e-Shahadat, 1984.",
        "In the context of the PPC, Section 304 addresses the proof required for qatl-i-amd liable to qisas, detailing acceptable forms of evidence such as voluntary confessions or specified evidentiary requirements.",
        "Section 304 PPC specifies the methods of proving qatl-i-amd liable to qisas, including voluntary confessions by the accused or evidence as prescribed in Article 17 of the Qanun-e-Shahadat, 1984."
      ]
    },
    {
      "tag": "information of 305",
      "patterns": [
        "What do you mean by the 305 act in law?",
        "What is section 305 related to?",
        "Explain the section 305?",
        "Which person is liable to 305?",
        "Information about 305",
        "What is 305?",
        "Pakistan Penal Code Section 305",
        "PPC 305 Pakistan",
        "Section 305 PPC",
        "Pakistan Penal Code Section 305 full text",
        "Full text of PPC 305",
        "PPC 305 legal provisions",
        "Section 305 PPC Pakistan jurisdiction",
        "PPC 305 case law Pakistan",
        "Historical background of PPC Section 305",
        "Evolution of Section 305 in Pakistan Penal Code",
        "Legal Commentary of 305",
        "Legal commentary on PPC Section 305",
        "Interpretation of Section 305 PPC",
        "Expert opinions on PPC 305",
        "Give me the detail of 305",
        "What does Section 305 PPC define?",
        "Can you explain PPC Section 305?",
        "What are the key points of Section 305?",
        "How is Section 305 defined in PPC?",
        "Details about Section 305 of PPC",
        "PPC 305 legal definitions",
        "How does Section 305 of PPC apply?",
        "Legal interpretation of Section 305",
        "Explain the legal terms in Section 305",
        "Who is considered the wali according to Section 305?",
        "Describe the provisions of Section 305 PPC",
        "Can you please provide me the detail of section 305",
        "Can you provide me the detail of section 305"
      ],
      "responses": [
        "Wali: \nIn case of qatl, the wali shall be--\n(a) the heirs of the victim, according to his personal law  115[but shall not include the accused or the convict in case of qatl-i-amd if committed in the name or on the pretext of honour] 115; and\n(b) the Government, if there is no heir.",
        "Section 305 of the Pakistan Penal Code defines who the wali (legal guardian) is in cases of qatl. The wali is determined as the heirs of the victim according to the victim's personal law, excluding the accused or convict in cases of qatl-i-amd committed in the name or on the pretext of honor. If there are no heirs, the government becomes the wali.",
        "According to Section 305 of the PPC, the wali in cases of qatl is determined as the heirs of the victim according to the victim's personal law. However, in cases of qatl-i-amd committed in the name or on the pretext of honor, the accused or convict is not considered the wali. If there are no heirs, the government assumes the role of the wali.",
        "Under Section 305 of the Pakistan Penal Code, the wali in cases of qatl is determined as the heirs of the victim according to the victim's personal law, excluding the accused or convict in cases of qatl-i-amd committed in the name or on the pretext of honor. If there are no heirs, the government acts as the wali.",
        "The Pakistan Penal Code Section 305 outlines who the wali is in cases of qatl. The wali is defined as the heirs of the victim according to the victim's personal law, excluding the accused or convict in cases of qatl-i-amd committed in the name or on the pretext of honor. If there are no heirs, the government becomes the wali.",
        "Section 305 PPC describes who the wali is in cases of qatl, specifying that it is the heirs of the victim according to the victim's personal law, except for cases of qatl-i-amd committed in the name or on the pretext of honor. If there are no heirs, the government becomes the wali.",
        "In the context of the PPC, Section 305 addresses the determination of the wali in cases of qatl, stipulating that it is the heirs of the victim according to the victim's personal law, except in specific circumstances such as qatl-i-amd committed in the name or on the pretext of honor. If there are no heirs, the government serves as the wali.",
        "Section 305 PPC specifies who the wali is in cases of qatl, detailing that it is the heirs of the victim according to the victim's personal law, with exceptions for cases of qatl-i-amd committed in the name or on the pretext of honor. If there are no heirs, the government becomes the wali."
      ]
    },
    {
      "tag": "information of 306",
      "patterns": [
        "What do you mean by the 306 act in law?",
        "What is section 306 related to?",
        "Explain the section 306?",
        "Which person is liable to 306?",
        "Information about 306",
        "What is 306?",
        "Pakistan Penal Code Section 306",
        "PPC 306 Pakistan",
        "Section 306 PPC",
        "Pakistan Penal Code Section 306 full text",
        "Full text of PPC 306",
        "PPC 306 legal provisions",
        "Section 306 PPC Pakistan jurisdiction",
        "PPC 306 case law Pakistan",
        "Historical background of PPC Section 306",
        "Evolution of Section 306 in Pakistan Penal Code",
        "Legal Commentary of 306",
        "Legal commentary on PPC Section 306",
        "Interpretation of Section 306 PPC",
        "Expert opinions on PPC 306",
        "Give me the detail of 306",
        "What does Section 306 PPC define?",
        "Can you explain PPC Section 306?",
        "What are the key points of Section 306?",
        "How is Section 306 defined in PPC?",
        "Details about Section 306 of PPC",
        "PPC 306 legal definitions",
        "How does Section 306 of PPC apply?",
        "Legal interpretation of Section 306",
        "Explain the legal terms in Section 306",
        "Who is not liable to qisas according to Section 306?",
        "Describe the provisions of Section 306 PPC",
        "Can you please provide me the detail of section 306",
        "Can you provide me the detail of section 306"
      ],
      "responses": [
        "Qatl-e-amd not liable to qisas: \nQatl-i-Amd shall not be liable to qisas in the following cases, namely:--\n(a) when an offender is a minor or insane:\n Provided that, where a person liable to qisas associates himself in the commission of the offence with a person not liable to qisas, with the intention of saving himself from qisas, he shall not be exempted from qisas; \n(b) when an offender causes death of his child or grand-child, however low-so-ever; and\n(c) when any wali of the victim is a direct descendant, however low-so-ever, of the offender.",
        "Section 306 of the Pakistan Penal Code outlines instances where qatl-e-amd (intentional killing) is not liable to qisas (retaliation). These include cases where the offender is a minor or insane, when the offender causes the death of their child or grandchild, and when any wali of the victim is a direct descendant of the offender.",
        "According to Section 306 of the PPC, qatl-e-amd is not liable to qisas in certain circumstances. These include cases where the offender is a minor or insane, when the offender causes the death of their child or grandchild, and when any wali of the victim is a direct descendant of the offender.",
        "Under Section 306 of the Pakistan Penal Code, qatl-e-amd is not liable to qisas in specific situations. These include instances where the offender is a minor or insane, when the offender causes the death of their child or grandchild, and when any wali of the victim is a direct descendant of the offender.",
        "The Pakistan Penal Code Section 306 specifies cases where qatl-e-amd is not liable to qisas. These include situations where the offender is a minor or insane, when the offender causes the death of their child or grandchild, and when any wali of the victim is a direct descendant of the offender.",
        "Section 306 PPC describes scenarios where qatl-e-amd is not subject to qisas, such as when the offender is a minor or insane, when the offender causes the death of their child or grandchild, and when any wali of the victim is a direct descendant of the offender.",
        "In the context of the PPC, Section 306 addresses exceptions to qisas for qatl-e-amd, specifying cases where qatl-i-amd is not liable to qisas, including instances involving minors or insane offenders, the death of a child or grandchild by the offender, and when the victim's wali is a direct descendant of the offender.",
        "Section 306 PPC outlines situations where qatl-e-amd is not liable to qisas, such as when the offender is a minor or insane, when the offender causes the death of their child or grandchild, and when any wali of the victim is a direct descendant of the offender."
      ]
    },
    {
      "tag": "information of 307",
      "patterns": [
        "What do you mean by the 307 act in law?",
        "What is section 307 related to?",
        "Explain the section 307?",
        "Which person is liable to 307?",
        "Information about 307",
        "What is 307?",
        "Pakistan Penal Code Section 307",
        "PPC 307 Pakistan",
        "Section 307 PPC",
        "Pakistan Penal Code Section 307 full text",
        "Full text of PPC 307",
        "PPC 307 legal provisions",
        "Section 307 PPC Pakistan jurisdiction",
        "PPC 307 case law Pakistan",
        "Historical background of PPC Section 307",
        "Evolution of Section 307 in Pakistan Penal Code",
        "Legal Commentary of 307",
        "Legal commentary on PPC Section 307",
        "Interpretation of Section 307 PPC",
        "Expert opinions on PPC 307",
        "Give me the detail of 307",
        "What does Section 307 PPC define?",
        "Can you explain PPC Section 307?",
        "What are the key points of Section 307?",
        "How is Section 307 defined in PPC?",
        "Details about Section 307 of PPC",
        "PPC 307 legal definitions",
        "How does Section 307 of PPC apply?",
        "Legal interpretation of Section 307",
        "Explain the legal terms in Section 307",
        "Under what circumstances is Qisas not enforced according to Section 307?",
        "Describe the provisions of Section 307 PPC",
        "Can you please provide me the detail of section 307",
        "Can you provide me the detail of section 307"
      ],
      "responses": [
        "Cases in which Qisas for qatl-i-amd shall not be enforced: \n(1) Qisas for qatl-i-amd shall not be enforced in the following cases, namely:--\n(a) when the offender dies before the enforcement of qisas;\n(b) when any wali voluntarily and without duress, to the satisfaction of the Court, waives the right of qisas under Section 309 or compounds under Section 310 and\n(c) when the right of qisas devolves on the offender as a result of the death of the wali of the victim, or on, the person who has no right of qisas against the offender.\n(2) To satisfy itself that the wali has waived the right of qisas under Section 309 or compounded the right of qisas under Section 310 voluntarily and without duress the Court shall take down the statement of the wali and such other persons as it may deem necessary on oath and record an opinion that it is satisfied that the Waiver or, as the case may be, the composition, was voluntary and not the result of any duress.\nIllustrations\n(i) A kills Z, the maternal uncle of his son B. Z has no other wali except D the wife of A. D has the right of qisas from A but if D dies, the right of qisas shall devolve on her son B who is also the son of the offender A. B cannot claim qisas against his father. Therefore, the qisas cannot be enforced.\n(ii) B kills Z, the brother of their husband A. Z has no heir except A. Here A can claim qisas from his wife B. But if A dies, the right of qisas shall devolve on his son D who is also son of B, the qisas cannot be enforced against B.",
        "Section 307 of the Pakistan Penal Code specifies instances where Qisas for qatl-i-amd (intentional killing) shall not be enforced. These include situations where the offender dies before the enforcement of qisas, when a wali voluntarily waives the right of qisas, and when the right of qisas devolves on the offender due to the death of the victim's wali or a person who has no right of qisas against the offender.",
        "According to Section 307 of the PPC, Qisas for qatl-i-amd shall not be enforced under certain circumstances, such as when the offender dies before the enforcement of qisas, when a wali voluntarily waives the right of qisas, and when the right of qisas devolves on the offender due to specific conditions.",
        "Under Section 307 of the Pakistan Penal Code, Qisas for qatl-i-amd shall not be enforced in specified situations. These include cases where the offender dies before the enforcement of qisas, when a wali voluntarily waives the right of qisas, and when the right of qisas devolves on the offender due to certain conditions.",
        "The Pakistan Penal Code Section 307 outlines scenarios where Qisas for qatl-i-amd shall not be enforced, such as when the offender dies before the enforcement of qisas, when a wali voluntarily waives the right of qisas, and when the right of qisas devolves on the offender due to specific circumstances.",
        "Section 307 PPC describes circumstances where Qisas for qatl-i-amd shall not be enforced, including situations where the offender dies before the enforcement of qisas, when a wali voluntarily waives the right of qisas, and when the right of qisas devolves on the offender due to certain conditions.",
        "In the context of the PPC, Section 307 addresses exceptions to the enforcement of Qisas for qatl-i-amd, specifying cases where Qisas shall not be enforced. These include instances involving the death of the offender before the enforcement of qisas, voluntary waiver of qisas by a wali, and specific conditions regarding the devolution of the right of qisas.",
        "Section 307 PPC outlines situations where Qisas for qatl-i-amd shall not be enforced, such as when the offender dies before the enforcement of qisas, when a wali voluntarily waives the right of qisas, and when the right of qisas devolves on the offender due to certain circumstances."
      ]
    },
    {
      "tag": "information of 308",
      "patterns": [
        "What do you mean by the 308 act in law?",
        "What is section 308 related to?",
        "Explain the section 308?",
        "Which person is liable to 308",
        "Information about 308",
        "what is 308?",
        "Pakistan Penal Code Section 308",
        "PPC 308 Pakistan",
        "Section 308 PPC",
        "Pakistan Penal Code Section 308 full text",
        "Full text of PPC 308",
        "PPC 308 legal provisions",
        "Section 308 PPC Pakistan jurisdiction",
        "PPC 308 case law Pakistan",
        "Historical background of PPC Section 308",
        "Evolution of Section 308 in Pakistan Penal Code",
        "Legal Commentary of 308",
        "Legal commentary on PPC Section 308",
        "Interpretation of Section 308 PPC",
        "Expert opinions on PPC 308",
        "Give me the detail of 308",
        "Details on qatl-i-amd not liable to qisas",
        "What does Section 308 PPC entail?",
        "Can you explain PPC Section 308?",
        "Elaborate on the punishment in qatl-i-amd cases not liable to qisas",
        "How does Section 308 PPC apply?",
        "Clarify the legal provisions of Section 308 PPC",
        "What are the key points of Section 308 of PPC?",
        "PPC 308 punishment details",
        "Ta'zir in cases not liable to qisas according to PPC Section 308",
        "Clarify the concept of diyat in cases under Section 308 PPC",
        "Is there any flexibility in sentencing under Section 308 PPC?",
        "What factors does the court consider when imposing punishment under Section 308 PPC?",
        "Can you please provide me the detail of section 308",
        "Can you provide me the detail of section 308"
      ],
      "responses": [
        "Punishment in qatl-i-amd not liable to qisas, etc.: \n(1) Where an offender guilty of qatl-i-amd is not liable to qisas under Section 306 or the qisas is not enforceable under clause (c) of Section 307, he shall be liable to diyat:\nProvided that, where the offender is minor or insane, diyat shall be payable either from his property or, by such person as may be determined by the Court: \nProvided further that where at the time of committing qatl-i-amd the offender being a minor, had attained sufficient maturity of being insane, had a lucid interval, so as to be able to realize the consequences of his act, he may also be punished with imprisonment of either description for a term which may extend to twenty-five years as ta'zir. \nProvided further that, where the qisas is not enforceable under clause (c) of Section 307, the offender shall be liable to diyat only if there is any wali other than offender and if there is no wali other than the offender, he shall be punished with imprisonment of either description for a term which may extend to twenty-five years as ta'zir. \n(2) Notwithstanding anything contained in sub-section (1), the Court, having regard to the facts and circumstances of the case in addition to the punishment of diyat, may punish the offender with imprisonment of either description for a term which may extend to twenty-five years, as ta'zir.",
        "In cases where qatl-i-amd is not liable to qisas, Section 308 PPC provides for the imposition of diyat, which is a form of compensation to the victim's family or heirs. Additionally, the court may, based on the circumstances of the case, also impose imprisonment for a period not exceeding twenty-five years as ta'zir, in addition to the diyat.",
        "The concept of diyat under Section 308 PPC refers to the compensation payable to the victim's family or heirs in cases where qatl-i-amd is not subject to qisas. It can be paid from the offender's property or by another person determined by the court. If the offender is a minor or insane, diyat may be paid on their behalf.",
        "Section 308 PPC allows the court flexibility in sentencing by providing for imprisonment of up to twenty-five years as ta'zir in addition to the imposition of diyat. The court considers various factors such as the nature and severity of the offense, the offender's intent, and any mitigating or aggravating circumstances when determining the appropriate punishment."
      ]
    },

    {
      "tag": "information of 309",
      "patterns": [
        "What do you mean by the 309 act in law?",
        "What is section 309 related to?",
        "Explain the section 309?",
        "Which person is liable to 309",
        "Information about 309",
        "what is 309?",
        "Pakistan Penal Code Section 309",
        "PPC 309 Pakistan",
        "Section 309 PPC",
        "Pakistan Penal Code Section 309 full text",
        "Full text of PPC 309",
        "PPC 309 legal provisions",
        "Section 309 PPC Pakistan jurisdiction",
        "PPC 309 case law Pakistan",
        "Historical background of PPC Section 309",
        "Evolution of Section 309 in Pakistan Penal Code",
        "Legal Commentary of 309",
        "Legal commentary on PPC Section 309",
        "Interpretation of Section 309 PPC",
        "Expert opinions on PPC 309",
        "Give me the detail of 309",
        "Can you please provide me the detail of section 309",
        "Can you provide me the detail of section 309"
      ],
      "responses": [
        "Waiver (Afw) of qisas in qatl-i-amd:\n(1) In the case of qatl-i-amd, an adult sane wali may, at any time and without any compensation, waive his right of qisas:\nProvided that the right of qisas shall not be waived;\n(a) where the Government is the wali, or\n(b) where the right of qisas vests in a minor or insane.\n(2) Where a victim has more than one Wali any one of them may waive his right of qisas:\nProvided that the wali who does not waive the right of qisas shall be entitled to his share of diyat. \n(3) Where there are more than one victim, the waiver of the right of qisas by the wali of one victim shall not affect the right of qisas of the wali of the other victim.\n(4) Where there are more than one offenders, the waiver of the right of qisas against one offender shall not affect the right of qisas against the other offender.",
        "Explanation of Afw in qatl-i-amd:\nThe waiver (Afw) of qisas in cases of qatl-i-amd provides flexibility in the application of punishment, allowing the adult sane wali to voluntarily waive the right of qisas without compensation. This provision aims to address specific scenarios where the enforcement of qisas may not be appropriate or feasible, ensuring justice while considering individual circumstances.",
        "Legal Provisions Regarding Afw in PPC:\nSection 309 of the Pakistan Penal Code outlines the legal provisions regarding the waiver (Afw) of qisas in cases of qatl-i-amd. It establishes conditions under which an adult sane wali can waive the right of qisas without compensation, safeguarding the interests of both the victim and the offender within the framework of Islamic law.",
        "Historical Context of Afw in PPC:\nThe inclusion of provisions related to the waiver (Afw) of qisas in the Pakistan Penal Code reflects the historical development of Islamic jurisprudence and legal principles. These provisions have evolved over time to address societal needs while upholding the principles of justice and equity.",
        "Case Law and Interpretation of Afw:\nOver the years, case law and judicial interpretation have played a significant role in clarifying the application of the waiver (Afw) of qisas in qatl-i-amd cases. Courts have provided guidance on the implementation of Section 309 PPC, ensuring consistency and fairness in legal proceedings.",
        "Expert Opinions on Afw in PPC:\nLegal experts and scholars have offered various perspectives on the waiver (Afw) of qisas provisions in the Pakistan Penal Code. While some emphasize the importance of upholding traditional principles of Islamic law, others advocate for modern interpretations that consider contemporary societal values and human rights.",
        "Comparative Analysis of Afw Laws:\nComparative analysis of waiver (Afw) laws across different legal systems provides valuable insights into the strengths and limitations of the provisions in the Pakistan Penal Code. Such analysis facilitates an informed understanding of the effectiveness and relevance of Afw in ensuring justice and fairness."
      ]
    },
    {
      "tag": "information of 310",
      "patterns": [
        "What do you mean by the 310 act in law?",
        "What is section 310 related to?",
        "Explain the section 310?",
        "Which person is liable to 310",
        "information about 310",
        "what is 310?",
        "Pakistan Penal Code Section 310",
        "PPC 310 Pakistan",
        "Section 310 PPC",
        "Pakistan Penal Code Section 310 full text",
        "Full text of PPC 310",
        "PPC 310 legal provisions",
        "Section 310 PPC Pakistan jurisdiction",
        "PPC 310 case law Pakistan",
        "Historical background of PPC Section 310",
        "Evolution of Section 310 in Pakistan Penal Code",
        "Legal Commentary of 310",
        "Legal commentary on PPC Section 310",
        "Interpretation of Section 310 PPC",
        "Expert opinions on PPC 310",
        "Give me the detail of 310",
        "Details on compounding of qisas",
        "What does Section 310 PPC entail?",
        "Can you explain PPC Section 310 in detail?",
        "Elaborate on the compounding process in qatl-i-amd cases",
        "How does Section 310 PPC apply to legal proceedings?",
        "Clarify the legal provisions outlined in Section 310 PPC",
        "What are the key points of Section 310 of PPC?",
        "PPC 310 provisions on compounding of qisas",
        "Explain the concept of Sulh as per Section 310 PPC",
        "What is badl-i-sulh according to Section 310 of PPC?",
        "Clarify the process of badl-i-sulh in cases of qatl-i-amd",
        "PPC Section 310: Badl-i-sulh explanation",
        "Can you provide more information on the compounding of qisas under Section 310 PPC?",
        "Are there any specific conditions for compounding qisas in PPC Section 310?",
        "Does PPC Section 310 mention any exceptions to the compounding process?",
        "What is the significance of Section 310 PPC in criminal law?",
        "Can you explain the historical context of Section 310 of PPC?",
        "Can you please provide me the detail of section 310",
        "Can you provide me the detail of section 310"
      ],

      "responses": [
        "Compounding of qisas (Sulh) in qatl-i-amd:\n(1) In the case of qatl-i-amd, an adult sane wali may, at any time on accepting badl-i-sulh, compound his right of qisas:\nProvided that a female shall not be given in marriage or otherwise in badal-i-sulh.\n(2) Where a wali is a minor or an insane, the wali of such minor or insane wali may compound the right of qisas on behalf of such minor or insane wali:\nProvided that the value of badf-i-sufh shall not be less than the value of diyat.\n(3) Where the Government is the wali, it may compound the right of qisas:\nProvided that the value of badi-i-sulh shall not be less than the value of diyat.\n(4) Where the badl-i-sulh is not determined or is a property or a right the value of which cannot be determined in terms of money under Shari'ah, the right of qisas shall be deemed to have been compounded and the offender shall be liable to diyat.\n(5) Badl-i-sulh may be paid or given on demand or on a deferred date as may be agreed upon between the offender and the wali.\nExplanation: In this section, Badl-i-sulh means the mutually agreed compensation according to Shari'ah to be paid or given by the offender to a wali in cash or in kind or in the form of movable or immovable property.",
        "Section 310 PPC deals with the compounding of qisas (Sulh) in cases of qatl-i-amd. It outlines the conditions under which the right of qisas can be waived through the acceptance of compensation known as badl-i-sulh. The section provides provisions for the compounding process, including the involvement of adult sane walis, minors, the Government, and the determination of compensation. It also prohibits certain actions, such as giving a female in marriage as part of badl-i-sulh.",
        "Section 310 of the Pakistan Penal Code addresses the mechanism of compounding qisas (Sulh) in cases of qatl-i-amd. It specifies the conditions under which the right of qisas can be waived through mutual agreement and compensation. The section details the role of adult sane walis, minors, and the Government in the compounding process, as well as the methods of determining compensation. Additionally, it explains the concept of badl-i-sulh and its significance in resolving criminal disputes."
      ]
    },
    {
      "tag": "information of 311",
      "patterns": [
        "What do you mean by the 311 act in law?",
        "What is section 311 related to?",
        "Explain the section 311?",
        "Which person is layable to 311",
        "Information about 311",
        "What is 311?",
        "Pakistan Penal Code Section 311",
        "PPC 311 Pakistan",
        "Section 311 PPC",
        "Pakistan Penal Code Section 311 full text",
        "Full text of PPC 311",
        "PPC 311 legal provisions",
        "Section 311 PPC Pakistan jurisdiction",
        "PPC 311 case law Pakistan",
        "Historical background of PPC Section 311",
        "Evolution of Section 311 in Pakistan Penal Code",
        "Legal Commentary of 311",
        "Legal commentary on PPC Section 311",
        "Interpretation of Section 311 PPC",
        "Expert opinions on PPC 311",
        "Give me the detail of 311",
        "Can you provide insights on Section 311?",
        "Elaborate on PPC Section 311.",
        "Please explain the details of Section 311 of the PPC.",
        "Clarify the concept behind Section 311 of the Pakistan Penal Code.",
        "I'm interested in learning about Section 311 of the PPC.",
        "What does the law entail regarding Section 311?",
        "How does Section 311 of the PPC apply?",
        "Can you describe the key provisions of Section 311?",
        "PPC Section 311 - what should I know?",
        "Any legal insights on Section 311 of the PPC?",
        "Could you shed light on the legal aspects of PPC Section 311?",
        "I'd like to understand the implications of Section 311 of the PPC.",
        "Please provide more information on Section 311.",
        "Tell me about the legal interpretations of PPC Section 311.",
        "What are the consequences defined by Section 311 of the PPC?",
        "How is Section 311 of the PPC enforced in Pakistan?",
        "What are the precedents related to Section 311 of the PPC?",
        "Discuss the historical context of Section 311 of the PPC.",
        "How has Section 311 evolved in the Pakistan Penal Code?",
        "Any notable case law regarding Section 311 of the PPC?",
        "Explain the legal commentary surrounding Section 311 of the PPC.",
        "What do legal experts say about PPC Section 311?",
        "What are the expert opinions on the application of PPC Section 311?",
        "Details on the implementation of PPC Section 311 in legal proceedings.",
        "Can you explain the legal interpretations of PPC Section 311?",
        "Are there any significant legal cases related to PPC Section 311?",
        "What are the jurisdictional aspects of PPC Section 311?",
        "Elucidate the legal provisions outlined in PPC Section 311.",
        "Any historical background on Section 311 of the PPC?",
        "Discuss the evolution of Section 311 within the Pakistan Penal Code.",
        "Please provide insights into the legal commentary on PPC Section 311.",
        "I'd like to know about the interpretation of PPC Section 311 in legal circles.",
        "Expert opinions on the implementation of PPC Section 311.",
        "Give me detailed information regarding PPC Section 311.",
        "Can you provide more elaboration on the provisions of PPC Section 311?",
        "Discuss the nuances of PPC Section 311.",
        "Please offer a comprehensive overview of PPC Section 311.",
        "I'm interested in the legal implications of PPC Section 311.",
        "Elaborate on the enforcement mechanisms of PPC Section 311.",
        "What are the legal considerations related to PPC Section 311?",
        "Explain how PPC Section 311 is interpreted in legal practice.",
        "Any legal precedents regarding PPC Section 311?",
        "What are the legal rights and liabilities under PPC Section 311?",
        "Elucidate the legal responsibilities defined by PPC Section 311.",
        "How does PPC Section 311 impact legal proceedings?",
        "Please discuss the legal ramifications of PPC Section 311.",
        "Can you provide case studies illustrating PPC Section 311?",
        "Discuss the ethical considerations related to PPC Section 311.",
        "Elaborate on the ethical implications of PPC Section 311.",
        "What are the societal implications of PPC Section 311?",
        "Please provide a comparative analysis of PPC Section 311 with similar statutes.",
        "Discuss the legislative intent behind PPC Section 311.",
        "Elucidate the principles governing PPC Section 311.",
        "What role does PPC Section 311 play in the criminal justice system?",
        "Please discuss the policy implications of PPC Section 311.",
        "How do legal scholars interpret PPC Section 311?",
        "What are the practical applications of PPC Section 311 in legal practice?",
        "Discuss any controversies or debates surrounding PPC Section 311.",
        "Can you please provide me the detail of section 311",
        "Can you provide me the detail of section 311"
      ],

      "responses": [
        "Ta'zir after waiver or compounding of right of qisas in qatl-i-amd:\nNotwithstanding anything contained in Section 309 or Section 310, where all the wali do not waive or compound the right of qisas, or  122[if] 122 the principle of fasad-fil-arz the Court may,  123[] 123 having regard to the facts and circumstances of the case, punish an offender against whom the right of qisas has been waived or compounded with  124[death or imprisonment for life or] 124 imprisonment of either description for a term of which may extend to fourteen years as ta'zir 125[:] 125\n126[\nProvided that if the offence has been committed in the name or on the pretext of honour, the imprisonment shall not be less than ten years. \n] 126\nExplanation: For the purpose of this section, the expression fasad-fil-arz shall include the past conduct of the offender, or whether he has any previous convictions, or the brutal or shocking manner in which the offence has been committed which is outrageous to the public conscience, or if the offender is considered a potential danger to the community  127[, or if the offence has been committed in the name or on the pretext of honour] 127. "
      ]
    },
    {
      "tag": "information of 312",
      "patterns": [
        "What do you mean by the 312 act in law?",
        "What is section 312 related to?",
        "Explain the section 312?",
        "Which person is layable to 312",
        "Information about 312",
        "What is 312?",
        "Pakistan Penal Code Section 312",
        "PPC 312 Pakistan",
        "Section 312 PPC",
        "Pakistan Penal Code Section 312 full text",
        "Full text of PPC 312",
        "PPC 312 legal provisions",
        "Section 312 PPC Pakistan jurisdiction",
        "PPC 312 case law Pakistan",
        "Historical background of PPC Section 312",
        "Evolution of Section 312 in Pakistan Penal Code",
        "Legal Commentary of 312",
        "Legal commentary on PPC Section 312",
        "Interpretation of Section 312 PPC",
        "Expert opinions on PPC 312",
        "Give me the detail of 312",
        "What is the punishment for qatl-i-amd after waiver or compounding of qisas?",
        "Elaborate on qatl-i-amd cases after the waiver or compounding of qisas.",
        "Clarify the consequences for a wali committing qatl-i-amd after the waiver or compounding of qisas.",
        "What happens if a wali commits qatl-i-amd after the waiver or compounding of qisas?",
        "Is there a provision in PPC for qatl-i-amd cases after waiver or compounding of qisas?",
        "Can you explain the implications of Section 312 in PPC?",
        "Detail the legal repercussions of committing qatl-i-amd after the waiver or compounding of qisas according to PPC Section 312.",
        "What are the consequences for a wali who commits qatl-i-amd after the waiver or compounding of qisas in PPC?",
        "PPC 312 punishment details",
        "Can you please provide me the detail of section 312",
        "Can you provide me the detail of section 312"
      ],
      "responses": [
        "Qatl-i-amd after waiver or compounding of qisas:\nWhere a wali commits qatl-iamd of a convict against whom the right of qisas has been waived under Section 309 or compounded under Section 310, such wali shall be punished with-\n(a) qisas, if he had himself, waived or compounded the right of qisas against the convict or had knowledge of such waiver of-composition by another wali, or\n(b) diyat, if he had no knowledge of such waiver or composition."
      ]
    },
    {
      "tag": "information of 313",
      "patterns": [
        "What do you mean by the 313 act in law?",
        "What is section 313 related to?",
        "Explain the section 313?",
        "Which person is layable to 313",
        "Information about 313",
        "What is 313?",
        "Pakistan Penal Code Section 313",
        "PPC 313 Pakistan",
        "Section 313 PPC",
        "Pakistan Penal Code Section 313 full text",
        "Full text of PPC 313",
        "PPC 313 legal provisions",
        "Section 313 PPC Pakistan jurisdiction",
        "PPC 313 case law Pakistan",
        "Historical background of PPC Section 313",
        "Evolution of Section 313 in Pakistan Penal Code",
        "Legal Commentary of 313",
        "Legal commentary on PPC Section 313",
        "Interpretation of Section 313 PPC",
        "Expert opinions on PPC 313",
        "Give me the detail of 313",
        "Elaborate on the right of qisas in qatl-i-amd cases.",
        "Can you explain the right of qisas in PPC Section 313?",
        "Detail the legal provisions regarding the right of qisas in PPC.",
        "What are the legal implications of the right of qisas in qatl-i-amd according to PPC?",
        "PPC 313 provisions explanation",
        "Understand the application of qisas in qatl-i-amd according to PPC 313.",
        "Clarify the right of qisas in cases of qatl-i-amd under PPC 313.",
        "Discuss the significance of the right of qisas as per PPC Section 313.",
        "Explain the hierarchy of individuals entitled to the right of qisas in qatl-i-amd cases according to PPC 313.",
        "What conditions must be met for the Government to have the right of qisas in qatl-i-amd cases?",
        "PPC 313: Who has the authority to determine the right of qisas?",
        "Detail the exceptions to the right of qisas in PPC Section 313.",
        "Can you please provide me the detail of section 313",
        "Can you provide me the detail of section 313"
      ],
      "responses": [
        "Right of qisas in qatl-i-amd:\n(1) Where there is only one wali, he alone has the right of qisas in qatl-i-amd but, if there are more than one, the right of qisas vests in each of them.\n(2) If the victim-\n(a) has no wali, the Government shall have the right of qisas; or\n(b) has no wali other than a minor or insane or one of the wali is a minor or insane, the father or if he is not alive the paternal grandfather of such wali shall have the right of qisas on his behalf:\nProvided that, if the minor or insane wali has no father or paternal grandfather, how high-so-ever, alive and no guardian has been appointed by the Court, the Government shall have the right of qisas on his behalf.",
        "Exceptions to the right of qisas:\nThere are certain exceptions to the right of qisas as per PPC Section 313. These exceptions may include cases where the offence has been committed in the name or on the pretext of honour, or if the offender is considered a potential danger to the community. Additionally, the court may consider factors such as the past conduct of the offender, any previous convictions, or the brutal manner in which the offence has been committed."
      ]
    },
    {
      "tag": "information of 314",
      "patterns": [
        "Could you provide details about Section 314 of the Pakistan Penal Code?",
        "What offenses are covered under Section 314 PPC?",
        "I'm looking for information on the legal provisions of Section 314.",
        "Can you explain the jurisdiction of Section 314 PPC?",
        "Are there any recent judgments related to Section 314 in Pakistani courts?",
        "I need to understand the implications of Section 314 in Pakistani law.",
        "What are the punishments prescribed under Section 314 PPC?",
        "Could you elaborate on the historical background of Section 314 in the Pakistan Penal Code?",
        "I'm interested in learning about any amendments made to Section 314 over time.",
        "Can you provide examples of cases where Section 314 has been applied?",
        "How is Section 314 interpreted in legal contexts?",
        "Do you have any expert opinions or commentaries on Section 314 of the PPC?",
        "What is the significance of Section 314 in the broader legal framework of Pakistan?",
        "Could you discuss the applicability of Section 314 in different scenarios?",
        "Are there any exceptions or special circumstances mentioned in Section 314?",
        "Can you please provide me the detail of section 314",
        "Can you provide me the detail of section 314"
      ],
      "responses": [
        "Execution of qisas in qatl-i-amd:\n(1) Qisas in Qatll-i-amd shall be executed by a functionary of the Government by causing death of the convict as the Court may direct.\n(2) Qisas shall not be executed until all the wali are present at the time of execution, either personally or through their representatives authorised by them in writing in this behalf: Provided that where a wali or his representative fails to present himself on the date, time and place of execution of qisas after having been informed of the date, time and place as certified by the Court, an officer authorised by the Court shall give permission for the execution of qisas and the Government shall cause execution of qisas in the absence of such wali.\n(3) If the convict is a woman who is pregnant, the Court may, in consultation with an authorised medical officer, postpone the execution of qisas up to a period of two years after the birth of the child and during this period she may be released on bail on furnishing of security to the satisfaction of the Court, or, if she is not so released she shall, be dealt with as if sentenced to simple imprisonment.",
        "Section 314 of the Pakistan Penal Code pertains to the execution of qisas in cases of qatl-i-amd. Qisas, which means retribution, is the Islamic principle of equal punishment for equivalent harm caused. In cases of intentional murder (qatl-i-amd), qisas is carried out by the state, with the execution being directed by the court. The section outlines the procedure for executing qisas, including the presence of all wali (legal heirs) during the execution and provisions for postponing the execution in the case of a pregnant convict."
      ]
    },
    {
      "tag": "information of 315",
      "patterns": [
        "What is the legal significance of Section 315 in the Pakistan Penal Code?",
        "Can you explain the implications of Section 315?",
        "What constitutes qatl shibh-i-amd according to Section 315 of the PPC?",
        "Who falls under the purview of Section 315?",
        "I'd like to understand the legal provisions outlined in Section 315 of the PPC.",
        "Could you provide details about Section 315 and its application?",
        "Are there any notable cases where Section 315 was invoked?",
        "How has Section 315 evolved over time within the Pakistan Penal Code?",
        "What do legal experts opine about the interpretation of Section 315?",
        "Give me an overview of Section 315 and its significance within Pakistani law.",
        "Can you please provide me the detail of section 315",
        "Can you provide me the detail of section 315"
      ],
      "responses": [
        "In the Pakistan Penal Code, Section 315 defines qatl shibh-i-amd, which pertains to causing the death of a person with the intent to harm their body or mind using a weapon or an act that is not inherently fatal. For instance, if an individual strikes another with a stick or stone intending to cause harm, resulting in the victim's death, it would be considered qatl shibh-i-amd under this provision. This section plays a crucial role in defining and prosecuting such acts within the legal framework of Pakistan."
      ]
    },
    {
      "tag": "information of 316",
      "patterns": [
        "What do you mean by the 316 act in law?",
        "What is section 316 related to?",
        "Explain the section 316?",
        "Which person is layable to 316",
        "information about 316",
        "what is 316?",
        "Pakistan Penal Code Section 316",
        "PPC 316 Pakistan",
        "Section 316 PPC",
        "Pakistan Penal Code Section 316 full text",
        "Full text of PPC 316",
        "PPC 316 legal provisions",
        "Section 316 PPC Pakistan jurisdiction",
        "PPC 316 case law Pakistan",
        "Historical background of PPC Section 316",
        "Evolution of Section 316 in Pakistan Penal Code",
        "Legal Commentary of 316",
        "Legal commentary on PPC Section 316",
        "Interpretation of Section 316 PPC",
        "Expert opinions on PPC 316",
        "Give me the detail of 316",
        "Can you please provide me the detail of section 316",
        "Can you provide me the detail of section 316"
      ],

      "responses": [
        "Punishment for Qatl shibh-i-amd:\nWhoever commits qatl shibh-i-amd shall be liable to diyat and may also be punished with imprisonment of either description for a term which may extend to  128[twenty-five years] 128 years as ta'zir."
      ]
    },
    {
      "tag": "information of 317",
      "patterns": [
        "What do you mean by the 317 act in law?",
        "What is section 317 related to?",
        "Explain the section 317?",
        "Which person is layable to 317",
        "information about 317",
        "what is 317?",
        "Pakistan Penal Code Section 317",
        "PPC 317 Pakistan",
        "Section 317 PPC",
        "Pakistan Penal Code Section 317 full text",
        "Full text of PPC 317",
        "PPC 317 legal provisions",
        "Section 317 PPC Pakistan jurisdiction",
        "PPC 317 case law Pakistan",
        "Historical background of PPC Section 317",
        "Evolution of Section 317 in Pakistan Penal Code",
        "Legal Commentary of 317",
        "Legal commentary on PPC Section 317",
        "Interpretation of Section 317 PPC",
        "Expert opinions on PPC 317",
        "Give me the detail of 317",
        "Can you please provide me the detail of section 317",
        "Can you provide me the detail of section 317"
      ],

      "responses": [
        "Person committing qatl debarred from succession:\nWhere a person committing qatl-i-amd or Qatl shibh-i-amd is an heir or a beneficiary under a will, he shall be debarred from succeeding to the estate of the victim as an heir or a beneficiary."
      ]
    },
    {
      "tag": "information of 318",
      "patterns": [
        "What do you mean by the 318 act in law?",
        "What is section 318 related to?",
        "Explain the section 318?",
        "Which person is layable to 318",
        "information about 318",
        "what is 318?",
        "Pakistan Penal Code Section 318",
        "PPC 318 Pakistan",
        "Section 318 PPC",
        "Pakistan Penal Code Section 318 full text",
        "Full text of PPC 318",
        "PPC 318 legal provisions",
        "Section 318 PPC Pakistan jurisdiction",
        "PPC 318 case law Pakistan",
        "Historical background of PPC Section 318",
        "Evolution of Section 318 in Pakistan Penal Code",
        "Legal Commentary of 318",
        "Legal commentary on PPC Section 318",
        "Interpretation of Section 318 PPC",
        "Expert opinions on PPC 318",
        "Give me the detail of 318",
        "Can you please provide me the detail of section 318",
        "Can you provide me the detail of section 318"
      ],

      "responses": [
        "Qatl-i-khata:\nWhoever, without any intention to cause death of, or cause harm to, a person causes death of such person, either by mistake of act or by mistake of fact, is said to commit qatl-i-khata.\nIllustrations\n(a) A aims at a deer but misses the target and kills Z who is standing by, A is guilty of qatl-i-khata.\n(b) A shoots at an object to be a boar but it turns out to be a human being. A is guilty of qatl-i-khata."
      ]
    },
    {
      "tag": "information of 319",
      "patterns": [
        "What do you mean by the 319 act in law?",
        "What is section 319 related to?",
        "Explain the section 319?",
        "Which person is layable to 319",
        "information about 319",
        "what is 319?",
        "Pakistan Penal Code Section 319",
        "PPC 319 Pakistan",
        "Section 319 PPC",
        "Pakistan Penal Code Section 319 full text",
        "Full text of PPC 319",
        "PPC 319 legal provisions",
        "Section 319 PPC Pakistan jurisdiction",
        "PPC 319 case law Pakistan",
        "Historical background of PPC Section 319",
        "Evolution of Section 319 in Pakistan Penal Code",
        "Legal Commentary of 319",
        "Legal commentary on PPC Section 319",
        "Interpretation of Section 319 PPC",
        "Expert opinions on PPC 319",
        "Give me the detail of 319",
        "Can you please provide me the detail of section 319",
        "Can you provide me the detail of section 319"
      ],

      "responses": [
        "Punishment for qatl-i-khata:\nWhoever commits qatl-i-khata shall be liable to diyat:\nProvided that, where qatl-i-khata is committed by a rash or negligent act, other than rash or negligent driving, the offender may, in addition to diyat, also be punished with imprisonment of either description for a term which may extend to five years as ta'zir. "
      ]
    },
    {
      "tag": "information of 320",
      "patterns": [
        "What do you mean by the 320 act in law?",
        "What is section 320 related to?",
        "Explain the section 320?",
        "Which person is layable to 320",
        "information about 320",
        "what is 320?",
        "Pakistan Penal Code Section 320",
        "PPC 320 Pakistan",
        "Section 320 PPC",
        "Pakistan Penal Code Section 320 full text",
        "Full text of PPC 320",
        "PPC 320 legal provisions",
        "Section 320 PPC Pakistan jurisdiction",
        "PPC 320 case law Pakistan",
        "Historical background of PPC Section 320",
        "Evolution of Section 320 in Pakistan Penal Code",
        "Legal Commentary of 320",
        "Legal commentary on PPC Section 320",
        "Interpretation of Section 320 PPC",
        "Expert opinions on PPC 320",
        "Give me the detail of 320",
        "Can you please provide me the detail of section 320",
        "Can you provide me the detail of section 320"
      ],

      "responses": [
        "Punishment for qatl-i-khata by rash or negligent driving:\nWhoever commits qatl-ikhata by rash or negligent driving shall, having regard to the facts and circumstances the case, in addition to diyat, be punished with imprisonment of either description for a term which may extend to ten years."
      ]
    },
    {
      "tag": "information of 321",
      "patterns": [
        "What do you mean by the 321 act in law?",
        "What is section 321 related to?",
        "Explain the section 321?",
        "Which person is layable to 321",
        "information about 321",
        "what is 321?",
        "Pakistan Penal Code Section 321",
        "PPC 321 Pakistan",
        "Section 321 PPC",
        "Pakistan Penal Code Section 321 full text",
        "Full text of PPC 321",
        "PPC 321 legal provisions",
        "Section 321 PPC Pakistan jurisdiction",
        "PPC 321 case law Pakistan",
        "Historical background of PPC Section 321",
        "Evolution of Section 321 in Pakistan Penal Code",
        "Legal Commentary of 321",
        "Legal commentary on PPC Section 321",
        "Interpretation of Section 321 PPC",
        "Expert opinions on PPC 321",
        "Give me the detail of 321",
        "Can you please provide me the detail of section 321",
        "Can you provide me the detail of section 321"
      ],

      "responses": [
        "Qatl-bis-sabab:\nWhoever, without any intention, cause death of, or cause harm to, any person, does any unlawful act which becomes a cause for the death of another person, is said to commit qatl-bis-sabab.\nIllustration\nA unlawfully digs a pit in the thoroughfare, but without any intention to cause death of, or harm to, any person, B while passing from there falls in it and is killed. A has committed qatl-bis-sabab."
      ]
    },
    {
      "tag": "information of 322",
      "patterns": [
        "What do you mean by the 322 act in law?",
        "What is section 322 related to?",
        "Explain the section 322?",
        "Which person is layable to 322",
        "information about 322",
        "what is 322?",
        "Pakistan Penal Code Section 322",
        "PPC 322 Pakistan",
        "Section 322 PPC",
        "Pakistan Penal Code Section 322 full text",
        "Full text of PPC 322",
        "PPC 322 legal provisions",
        "Section 322 PPC Pakistan jurisdiction",
        "PPC 322 case law Pakistan",
        "Historical background of PPC Section 322",
        "Evolution of Section 322 in Pakistan Penal Code",
        "Legal Commentary of 322",
        "Legal commentary on PPC Section 322",
        "Interpretation of Section 322 PPC",
        "Expert opinions on PPC 322",
        "Give me the detail of 322",
        "Can you please provide me the detail of section 322",
        "Can you provide me the detail of section 322"
      ],

      "responses": [
        "Punishment for qatl-bis-sabab:\nWhoever commit qatl bis-sabab shall be liable to diyat."
      ]
    },
    {
      "tag": "information of 323",
      "patterns": [
        "What do you mean by the 323 act in law?",
        "What is section 323 related to?",
        "Explain the section 323?",
        "Which person is layable to 323",
        "information about 323",
        "what is 323?",
        "Pakistan Penal Code Section 323",
        "PPC 323 Pakistan",
        "Section 323 PPC",
        "Pakistan Penal Code Section 323 full text",
        "Full text of PPC 323",
        "PPC 323 legal provisions",
        "Section 323 PPC Pakistan jurisdiction",
        "PPC 323 case law Pakistan",
        "Historical background of PPC Section 323",
        "Evolution of Section 323 in Pakistan Penal Code",
        "Legal Commentary of 323",
        "Legal commentary on PPC Section 323",
        "Interpretation of Section 323 PPC",
        "Expert opinions on PPC 323",
        "Give me the detail of 323",
        "Can you please provide me the detail of section 323",
        "Can you provide me the detail of section 323"
      ],

      "responses": [
        "Value of diyat:\n(1) The Court shall, subject to the Injunctions of Islam as laid down in the Holy Qur'an and Sunnah and keeping in view the financial position of the convict and the heirs of the victim, fix the value of diyat which shall not be less than the value of thirty thousand six hundred and thirty grams of silver.\n(2) For the purpose of sub-section (1), the Federal Government shall, by notification in the official Gazette, declare the value of Silver, on the first day of July each year or on such date as it may deem fit, which shall be the value payable during a financial year."
      ]
    },
    {
      "tag": "information of 324",
      "patterns": [
        "What do you mean by the 324 act in law?",
        "What is section 324 related to?",
        "Explain the section 324?",
        "Which person is layable to 324",
        "information about 324",
        "what is 324?",
        "Pakistan Penal Code Section 324",
        "PPC 324 Pakistan",
        "Section 324 PPC",
        "Pakistan Penal Code Section 324 full text",
        "Full text of PPC 324",
        "PPC 324 legal provisions",
        "Section 324 PPC Pakistan jurisdiction",
        "PPC 324 case law Pakistan",
        "Historical background of PPC Section 324",
        "Evolution of Section 324 in Pakistan Penal Code",
        "Legal Commentary of 324",
        "Legal commentary on PPC Section 324",
        "Interpretation of Section 324 PPC",
        "Expert opinions on PPC 324",
        "Give me the detail of 324",
        "Can you please provide me the detail of section 324",
        "Can you provide me the detail of section 324"
      ],

      "responses": [
        "Attempt to commit qatl-i-amd:\nWhoever does any act with such intention or knowledge, and under such circumstances, that, if he by that act caused qatl, he would be guilty of qatl-i-amd, shall be punished with imprisonment for either description for a term which may extend to ten years  129[but shall not be less than five years if the offence has been committed in the name or on the pretext of honour] 129, and shall also be liable to fine, and, if hurt is caused to any person by such act, the offender shall, in addition to the imprisonment and fine as aforesaid, be liable to the punishment provided for the hurt caused:\nProvided that where the punishment for the hurt is qisas which is not executable, the offender shall be liable to arsh and may also be punished with imprisonment of either description for a term which may extend to seven years. "
      ]
    }
  ]
}
